Revit 2026 API

# GenericZoneAddSpaces Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddSpaces(
	ISet<ElementId> spaceIds
)
```
```vb
Public Sub AddSpaces (
	spaceIds As ISet(Of ElementId)
)
```
```cpp
public:
void AddSpaces(
	ISet<ElementId^>^ spaceIds
)
```
```fsharp
member AddSpaces :
        spaceIds : ISet<ElementId> -> unit
```

#### Parameters

spaceIds ISetElementId

#### Reference

GenericZone Class

Autodesk.Revit.DB.Analysis Namespace